<?php
ini_set('error_reporting', E_ALL);
ini_set('display_errors', 1);
ini_set('display_startup_errors', 1);
header('Content-type:application/json;charset=utf-8');
require_once($_SERVER['DOCUMENT_ROOT'].'/general/core.php');
$settings = new Settings;

// phpinfo();
//
// $data_array = array(104120,81920);
//
//
// $data = $settings->get_log_api_response('day');

// var_dump($data);

$action = 'проверка действий';
$type_of_message = 'text';

$data = $settings->add_history_users_fulldata($action,$type_of_message);

var_dump($data);



//
// $stroka = '{"last_name":"Мальченко","name":"Юлия","second_name":"Анатольевна","email":"malyulya@list.ru","photo":"\t+79111944415","company":"СПбГУ","DOB":"25.01.1985","job":"СПбГУ","status":"аспирант","activation":"y"}';
//
// $id = 49129;
//
// $data = $settings->cron_mass_update_user_field($stroka,$id);
//
// var_dump($data);


// обновление полей в tboil
// $fillable = [
//             'NAME' => 'name',
//             'SECOND_NAME' => 'second_name',
//             'LAST_NAME' => 'last_name',
//             'PERSONAL_PROFESSION' => 'profession',
//             'WORK_COMPANY' => 'company',
//             'PERSONAL_PHONE' => 'phone',
//             'UF_URL_LID' => 'first_referer',
//             'PERSONAL_BIRTHDAY' => 'DOB',
//             'PERSONAL_PHOTO' => 'photo',
//             'PERSONAL_CITY' => 'adres',
//             'WORK_PHONE' => '',
//             'WORK_CITY' => '',
//             'WORK_STATE' => '',
//             'WORK_CITY' => '',
//             'PERSONAL_WWW' => '',
//             'PERSONAL_ICQ' => '',
//             'PERSONAL_GENDER' => '',
// ];
//
//
// $new_array_for_tboil = array_flip($fillable);
//
// var_dump($fillable);
// var_dump($new_array_for_tboil);
//
//
// unset($new_array_for_tboil[null]);
//
// $fields = array_flip($new_array_for_tboil);
//
// var_dump($fields);

// $data_json_residents = '[
//                   {
//                   "ФирменноеНазвание": "ТАЙПТАЙП",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7814193820",
//                   "КакДобраться": "Аптекарский пр. д.2",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Пашментов Н. Г.",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "http://wowmosaic.ru/",
//                   "ИНН": "",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "АйТи План",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "102",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7840008270",
//                   "КакДобраться": "СПб, Наб. реки Карповки д.5 корп.22, ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Торганова К.С. ИП",
//                   "Корпус": "17",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "http://nova-florist.com/",
//                   "ИНН": "781423786080",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Экзиклуб",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "http://exiclub.ru/",
//                   "ИНН": "7806442462",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "СкайКейс",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7802719554",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "РЭДМЭДРОБОТ СПБ",
//                   "Корпус": "1",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "https://www.redmadrobot.ru/",
//                   "ИНН": "7813243838",
//                   "КакДобраться": "пр.Медиков, д.3, лит.А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ТЕХНОПАРК САНКТ-ПЕТЕРБУРГА АО",
//                   "Корпус": "1",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7811378050",
//                   "КакДобраться": "пр.Медиков, д.3, лит.А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "АПЕЛЬСИН - ШКОЛА НЕФОРМАЛЬНОГО ОБРАЗОВАНИЯ ЧОУ ДО",
//                   "Корпус": "26",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813290563",
//                   "КакДобраться": "Спб,наб.реки Карповки д.5. Лит С",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "КофеБон РУС",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7814164787",
//                   "КакДобраться": "Аткекарский пр. д.2",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЭПСИЛОН",
//                   "Корпус": "0",
//                   "Этаж": "0",
//                   "Кабинет": "0",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7727713688",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЛабПэк",
//                   "Корпус": "14",
//                   "Этаж": "2",
//                   "Кабинет": "201",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813585052",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Кондор БФД",
//                   "Корпус": "27",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813561767",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Фесенко П.В.",
//                   "Корпус": "22",
//                   "Этаж": "цоколь",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "",
//                   "КакДобраться": "Спб, Наб. реки Карповки д.5 корп.22 ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Рексофт",
//                   "Корпус": "1",
//                   "Этаж": "4",
//                   "РежимРаботы": "",
//                   "Сайт": "https://www.reksoft.ru/",
//                   "ИНН": "7802020639",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "КИД БЮРО",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "206",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7839030714",
//                   "КакДобраться": "Наб.реки Карповки д.5 к.22 ЛитА ",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ОРНИТЕК",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "204",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7838077029",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "АСК Лаборатория",
//                   "Корпус": "7",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": " https://lpmtech.ru/rezidenty/",
//                   "ИНН": "7801396519",
//                   "КакДобраться": "Набережная реки Карповки, дом 5, литер Г",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЦКБ42",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813264482",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Васильева А.Р. (ИП)",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "313",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "470510201550",
//                   "КакДобраться": "Наб. реки Карповки д.5 корп22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Дебатур Игорь Петрович ИП",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "203",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "780430969485",
//                   "КакДобраться": "Спб, Наб реки Карповки д.5, корп.22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ИНФОРМАЦИОННЫЕ МОБИЛЬНЫЕ СЕРВИСЫ",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "103",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7840343366",
//                   "КакДобраться": "СПб, Наб. реки Карповки д.5 корп.22 ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Головченко Е.В. ИП",
//                   "Корпус": "27",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "301302724842",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Назаренко А.Н. ИП",
//                   "Корпус": "27",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "780615520300",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Эделинк",
//                   "Корпус": "3",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7801526430",
//                   "КакДобраться": "набережная реки Карповки, дом 5, корпус 3, литера Е",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "АНО ПРКОСИ \"Со-творение\"",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "105",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "4703156111",
//                   "КакДобраться": "СПб, наб. реки Карповки д.5, корп.22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Мельничук Т.О. (ИП)",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "307",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "781713234349",
//                   "КакДобраться": "Спб, Наб. реки Карповки д.5, Корп.22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЛВ Интер",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "309",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7810352010",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ФИКА БИСТРО",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813631686",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Российский экспортный центр",
//                   "Корпус": "17",
//                   "Этаж": "4",
//                   "РежимРаботы": "",
//                   "Сайт": "https://www.exportcenter.ru/",
//                   "ИНН": "7703376553",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ООО \"НПП РиД\"",
//                   "Корпус": "11",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7816431808",
//                   "КакДобраться": "набережная реки Карповки, 5Р",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Научно Технический Центр \"БИТУСКАН\"",
//                   "Корпус": "3",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813643515",
//                   "КакДобраться": "набережная реки Карповки, дом 5, корпус 3, литера Е",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Казначеева А.Ю. (ИП)",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "315",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "720213283203",
//                   "КакДобраться": "Спб, Наб. реки Карповки д.5, Корп.22 Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "РОССИННО",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "https://new.rossinno.net/",
//                   "ИНН": "7811516504",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Кольцова Я.И.",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "317",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "663104611452",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Интерактивные обучающие технологии",
//                   "Корпус": "27",
//                   "Этаж": "5",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7807382880",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ИЗБА, НАО",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7840516594",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Гонзо-дизайн",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "302",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7842521649",
//                   "КакДобраться": "Спб, Наб.реки Карповки д.5 корп 22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "МСП Банк, АО",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "https://www.mspbank.ru/",
//                   "ИНН": "7703213534",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЦИФРОВАЯ СБОРКА",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "202",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "9703002022",
//                   "КакДобраться": "СПб, наб. реки карповки д.5, корп.22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Добагов А.З. (ИП)",
//                   "Корпус": "22",
//                   "Этаж": "4",
//                   "Кабинет": "406",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "070703950025",
//                   "КакДобраться": "Спб, наб. реки Карповки д.5, корп.22 Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Новый учитель (БФ)",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "104",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7710493032",
//                   "КакДобраться": "Наб. реки Карповки д.5 корп.22 Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Алексеев Александр Владимирович",
//                   "Корпус": "22",
//                   "Этаж": "4",
//                   "Кабинет": "408",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "773008859869",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "КОМ 212",
//                   "Корпус": "27",
//                   "Этаж": "4",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813248265",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Ковалев А.П.",
//                   "Корпус": "22",
//                   "Этаж": "цоколь",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "614707868585",
//                   "КакДобраться": "наб.реки Карповки к.22 Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Смирнова Е.Л. (ИП)",
//                   "Корпус": "2",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "780222676008",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера К",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Рэлиент",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "https://ralient.ai/ru",
//                   "ИНН": "7801655611",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ИП Балашов М.В.",
//                   "Корпус": "5",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "290408705070",
//                   "КакДобраться": "набережная реки Карповки, 5АК",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Контек",
//                   "Корпус": "17",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "https://conteq.ru/",
//                   "ИНН": "7842352849",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Ворлдскиллс Сервисес, ООО",
//                   "Корпус": "17",
//                   "Этаж": "4",
//                   "РежимРаботы": "",
//                   "Сайт": "https://wsservices.ru/",
//                   "ИНН": "9701101998 ",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "СПБ ЦПЭ, АНО ",
//                   "Корпус": "17",
//                   "Этаж": "4",
//                   "РежимРаботы": "",
//                   "Сайт": "https://spbexport.ru/",
//                   "ИНН": "7813641772 ",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Центропа",
//                   "Корпус": "5",
//                   "Этаж": "5",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7842175050",
//                   "КакДобраться": "набережная реки Карповки, 5АК",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Управляющая компания \"Со-творение\"",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "105",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7807149040",
//                   "КакДобраться": "СПб, НАб. реки Карповки д.5, корп.22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Французский Альянс",
//                   "Корпус": "5",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "http://fr-auto.com/",
//                   "ИНН": "7813454170",
//                   "КакДобраться": "набережная реки Карповки, 5АК",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Викулов Евгений Юрьевич",
//                   "Корпус": "22",
//                   "Этаж": "цоколь",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "",
//                   "КакДобраться": "Наб.реки Карповки д..к22 ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Реченская К.П. (ИП)",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "318",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "782002410020",
//                   "КакДобраться": "Спб, наб.реки Карповки д.5,корп.22 Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ФОНД  СОДЕЙСТВИЯ КРЕДИТОВАНИЮ МАЛОГО И СРЕДНЕГО БИЗНЕСА, МИКРОКРЕДИТНАЯ КОМПАНИЯ НО",
//                   "Корпус": "17",
//                   "Этаж": "4",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7838029258",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Центр компетенций ЛО",
//                   "Корпус": "27",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "4703171423",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Деловой ЦЕНТР",
//                   "Корпус": "22",
//                   "Этаж": "4",
//                   "Кабинет": "406",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7838076917",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Мастер Елисеева",
//                   "Корпус": "2",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "http://eliseevalab.com/",
//                   "ИНН": "7816547841",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера К",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Альтшу",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "107",
//                   "РежимРаботы": "",
//                   "Сайт": "http://altshu.com",
//                   "ИНН": "7813644124",
//                   "КакДобраться": "Спб, наб. реки Карповки д.5, корпус 22, ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Леонтьев Алексей Константинович",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "316",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "860322403357",
//                   "КакДобраться": "Спб. Наб. реки Карповки д.5, корп.22 ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Ковалев Д.А.",
//                   "Корпус": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Гайдзин Артс",
//                   "Корпус": "15",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "gaijin.ru",
//                   "ИНН": "5054011791",
//                   "КакДобраться": "Cпб, Аптекарский пр. д.2",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ХЕЛИКС",
//                   "Корпус": "28",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7802122535",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ВЕНДОС",
//                   "Корпус": "3",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7730643494",
//                   "КакДобраться": "набережная реки Карповки, дом 5, корпус 3, литера Е",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЛПМ-Контакт",
//                   "Корпус": "22",
//                   "Этаж": "4",
//                   "Кабинет": "413",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813105203",
//                   "КакДобраться": "СПб, наб.реки Карповки д.5, корпус 22, литА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "НПФ \"Эпитоп\"",
//                   "Корпус": "14",
//                   "Этаж": "3",
//                   "Кабинет": "302",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813495440",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "А2",
//                   "Корпус": "1",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813528456",
//                   "КакДобраться": "пр. Медиков, д.3, лит.А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "М-СТАНДАРТ холдинг",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "211",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7734249347",
//                   "КакДобраться": "Спб, наб.реки Карповки д.5, корп 22 ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ИП Худоев О.К.",
//                   "Корпус": "27",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "781300024318",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ООО \"Фалькейн\"",
//                   "Корпус": "28",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7814560491",
//                   "КакДобраться": "набережная реки Карповки, дом 5",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "МЕЛОГРАНО ФЭМИЛИ",
//                   "Корпус": "27",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813592606",
//                   "КакДобраться": "набережная реки Карповки, дом 5, литера П",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Типография Группа М",
//                   "Корпус": "3",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813595364",
//                   "КакДобраться": "проспект Медиков, дом 5, литера В",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ИП Беспёрстова О. Ю.",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "https://noplasticitsfantastic.store/",
//                   "ИНН": "632139851302",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Замятин И.С.",
//                   "Корпус": "22",
//                   "Этаж": "цоколь",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "780431292485",
//                   "КакДобраться": "Санкт-Петербург, наб. реки Карповки д.5, корп 22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Маркинг Хаб",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "205",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7816339560",
//                   "КакДобраться": "Спб, Наб. реки Карповки д.5,,Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ВЕРСТА",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "209",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7842148360",
//                   "КакДобраться": "Наб. реки Карповки д.5, корп.22 Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "СЕРВИС",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "209",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7842126543",
//                   "КакДобраться": "Спб, наб.реки Карповки д.5,корп. 22  Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Зеленская А. В.",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "Plant Buro",
//                   "ИНН": "753611258909",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ПАО Сбербанк",
//                   "Корпус": "11",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7707083893",
//                   "КакДобраться": "набережная реки Карповки, 5Р",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ЭРРАЙВАЛ РУС",
//                   "Корпус": "5",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7814620920",
//                   "КакДобраться": "набережная реки Карповки, 5АК",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Бифзавод",
//                   "Корпус": "15",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "http://beefzavod.com",
//                   "ИНН": "",
//                   "КакДобраться": "СПб, Аптекарский пр.д.2",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Никандров В.А.",
//                   "Корпус": "22",
//                   "Этаж": "1",
//                   "Кабинет": "106",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "760401912442",
//                   "КакДобраться": "Спб, Наб. реки Карповки д, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Паринов О.О. (ИП)",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "312",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "143304712275",
//                   "КакДобраться": "Спб, наб.реки Карповки д.5, корп 22, Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Сазонов М.А.",
//                   "Корпус": "22",
//                   "Этаж": "2",
//                   "Кабинет": "207",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "550108625571",
//                   "КакДобраться": "Спб, Наб. реки Карповки д.5, корп.22 ЛитА",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Лаборатория имени Бурцева В.А.",
//                   "Корпус": "5",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7840074787",
//                   "КакДобраться": "набережная реки Карповки, 5АК",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ФИНЛЭКС",
//                   "Корпус": "22",
//                   "Этаж": "4",
//                   "Кабинет": "406",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "9709023678",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "ФПИ42",
//                   "Корпус": "17",
//                   "Этаж": "3",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7814760733",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "РИМ",
//                   "Корпус": "17",
//                   "Этаж": "1",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "7813628958",
//                   "КакДобраться": "наб.реки Карповки, д.5, кор. 17, лит. А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Миронова Елена Юрьевна",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "315",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "",
//                   "КакДобраться": "Спб, наб. реки Карповки д.5,корп.22,Лит А",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Козлов А.И.",
//                   "Корпус": "22",
//                   "Этаж": "цокольный",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "472004962181",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Миронюк П.А.",
//                   "Корпус": "22",
//                   "Этаж": "3",
//                   "Кабинет": "314",
//                   "РежимРаботы": "",
//                   "Сайт": "",
//                   "ИНН": "272422500051",
//                   "КакДобраться": "Спб, Наб. реки Карповки д.5, Корп.22 Лит А\n",
//                   "Направление": ""
//                   },
//                   {
//                   "ФирменноеНазвание": "Мусина Ирина Викторовна Гражданка РФ",
//                   "Корпус": "15",
//                   "Этаж": "2",
//                   "РежимРаботы": "",
//                   "Сайт": "https://irenelovestextile.com/",
//                   "ИНН": "741513387007",
//                   "КакДобраться": "",
//                   "Направление": ""
//                   }
//                   ]';
//
// $data = $settings->update_residents_lpm($data_json_residents);
// var_dump($data);



// $data = count(json_decode(file_get_contents('https://tboil.spb.ru/api/v2/getUserscom/?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VySWQiOiI4MTkyMCIsImV4cCI6MTYxNDY4NzI1OH0.95rnpwtLspd1X5ULcGZfUHq4zsNjtNim8vc2Nn4KPcQ'))->data);
// var_dump($data);

// $data = $settings->update_mass_main_users_comand($data_array,1);
// var_dump($data);

// $data = $settings->get_count_sum_support_fci_groupby_time_reg(true,'day','2020-11-22 00:00:00','2021-02-16 00:00:00');
// var_dump($data);

// $data = $settings->get_count_users_groupby_time_reg('year','2020.01.01','2021.02.09');
// var_dump($data);

// $date_added = date("Y-m-d H:i:s");
// $last_time_message = '2020-12-29 20:34:45';

// $start_date = new DateTime($date_added);
// $since_start = $start_date->diff(new DateTime($last_time_message));
// echo $since_start->days.' days total<br>';
// echo $since_start->y.' years<br>';
// echo $since_start->m.' months<br>';
// echo $since_start->d.' days<br>';
// echo $since_start->h.' hours<br>';
// echo $since_start->i.' minutes<br>';
// echo $since_start->s.' seconds<br>';
//
// $origin = date_create($date_added);
// $target = date_create($last_time_message);
// $interval = date_diff($origin, $target);
// $hours = intval($interval->format('%H'));
// $days =  intval($interval->format('%d'));
// $month = intval($interval->format('%m'));
// $years = intval($interval->format('%Y'));
//
// var_dump($hours);
// var_dump($days);
// var_dump($month);
// var_dump($years);
//
//
//
// $now_date = new DateTime(date($date_added));    //время сейчас
// $old_date = new DateTime($last_time_message); //дата с которой отчитываем
// $interval = $now_date->diff($old_date);
// echo $interval->format("%H:%I:%S - времени прошло");
//
//
// $time_now = strtotime($date_added);
// $time_need = strtotime($last_time_message);
//
// echo ($time_now-$time_need)/60/60;
// // echo '$period == "year"';
// $data = $settings->get_count_entity_groupby_time_reg('year');
// var_dump($data);
//
// echo '$period == "month"';
// $data = $settings->get_count_entity_groupby_time_reg('month');
// var_dump($data);
//
// echo '$period == "week"';
// $data = $settings->get_count_entity_groupby_time_reg('week');
// var_dump($data);
//
// echo '$period == "day"';
// $data = $settings->get_count_entity_groupby_time_reg('day');
//
// var_dump($data);


// $data = $settings->get_count_entity_skolkovo_groupby_time_reg('year');
// var_dump($data);
// $data = $settings->get_count_entity_skolkovo_groupby_time_reg('month');
// var_dump($data);
// $data = $settings->get_count_entity_skolkovo_groupby_time_reg('week');
// var_dump($data);
// $data = $settings->get_count_entity_skolkovo_groupby_time_reg('day');
// var_dump($data);



// $data = $settings->get_count_entity_fci_groupby_time_reg('year');
// var_dump($data);
// $data = $settings->get_count_entity_fci_groupby_time_reg('month');
// var_dump($data);
// $data = $settings->get_count_entity_fci_groupby_time_reg('week');
// var_dump($data);
// $data = $settings->get_count_entity_fci_groupby_time_reg('day');
// var_dump($data);
// $data = $settings->get_count_entity_fci_groupby_time_reg('data');
// var_dump($data);



// $data = $settings->get_count_entity_export_groupby_time_reg('year');
// var_dump($data);
// $data = $settings->get_count_entity_export_groupby_time_reg('month');
// var_dump($data);
// $data = $settings->get_count_entity_export_groupby_time_reg('week');
// var_dump($data);
// $data = $settings->get_count_entity_export_groupby_time_reg('day');
// var_dump($data);



// $data = $settings->get_current_parameters('technology');
// var_dump($data);
// $data = $settings->get_entity_search_by_parameter('msp','Среднее предприятие');
// var_dump($data);

// $data = $settings->get_entity_by_category('регион');
// var_dump($data);
// $data = $settings->get_entity_by_category('Район');
// var_dump($data);
// $data = $settings->get_entity_by_category('Тип');
// var_dump($data);
// $data = $settings->get_entity_by_category('Отрасль');
// var_dump($data);
// $data = $settings->get_entity_by_category('УчасСколково');
// var_dump($data);
// $data = $settings->get_entity_by_category('УчасФСИ');
// var_dump($data);
// $data = $settings->get_entity_by_category('УчасЛПМ');
// var_dump($data);
// $data = $settings->get_entity_by_category('экспорт');
// var_dump($data);
// $data = $settings->get_entity_by_category('all');
// var_dump($data);

//
// $data = $settings->get_users_entity_data();
// var_dump($data);







?>
